app/Validation/UserRules.php

SELECT *
FROM `users`
WHERE `username` = 'Princ Teme'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data){
        $model = new UserModel();

        if(!isset($data['username'])){
            $data['username'] = session()->get('username');
        }

        $user = $model->where('username', $data['username'])
                      ->first();

SELECT *
FROM `users`
WHERE `username` = 'ss'
 LIMIT 1
---
    public function doesntExist(string $str, string $fields, array $data){
        $model = new UserModel();

        $user = $model->where('username', $data['username'])
            ->first();