app/validation/UserRules.php

SELECT *
FROM `users`
WHERE `username` = 'test'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data){
        $model = new UserModel();

        $user = $model->where('username', $data['username'])
                      ->first();