app/Controllers/BaseController.php

SELECT *
FROM `users`
SELECT *
FROM `users`
WHERE `users`.`id` = '16'
---
    public function pridobizgodbe($zgodbe){
        $modelnaloge = new NalogeModel();
        $modelusers = new UserModel();

        $users = $modelusers->findAll();
        #var_dump(session()->get("projectId"));
        $i = 0;
        foreach ($zgodbe as $zgodba){
            $naloge = $modelnaloge->pridobiNalogeZgodbe($zgodbe[$i]['idZgodbe']);
            #var_dump($naloge);
            #echo '<br>';

            if($naloge != null){
                $indexnaloge = 0;
                foreach ($naloge as $naloga){
                    if(isset($naloge[$i]['clan_ekipe'])){
                        $naloge[$indexnaloge]['clan_ekipe_name'] = ($modelusers->find($naloge[$indexnaloge]['clan_ekipe']))['username'];