app/Controllers/ProjectsController.php

SELECT *
FROM `project`
---
    public function allProjects(){
        $model = new ProjectModel();
        $projects = $model->getUsersProjects(session()->get('id'));

INSERT INTO `naloge` (`zgodba_id`, `opis_naloge`, `ocena_casa`, `clan_ekipe`, `potrjen`) VALUES ('9', 'mojadruganaloga', '3', '16', 'N')
---
    public function dodajZgodbo(){
        $zgodba_id = $this->request->getVar('idZgodbe');
        $opis_naloge = $this->request->getVar('taskName');
        $ocena_casa  = $this->request->getVar('taskTime');
        $clan_ekipe = $this->request->getVar('taskMember');

        $model = new NalogeModel();
        $newdata = [
            'zgodba_id' => $zgodba_id,
            'opis_naloge' => $opis_naloge,
            'ocena_casa' => $ocena_casa,
            'clan_ekipe' => $clan_ekipe,
            'potrjen' => 'N',
        ];
        $model->save($newdata);